Israr-Engineering/PMM-06XX-IO-SPECIAL-PURPOSE/custom_Board/1.8.13/boards.txt
# PMM0680 (ESI Load Cell MODBUS TCP V2.2)
# --------------------------------------
PMM0680.name=PMM0680 (ESI Load Cell MODBUS TCP V2.2)
PMM0680.vid.0=0x2341
PMM0680.pid.0=0x804d
PMM0680.vid.1=0x2341
PMM0680.pid.1=0x004d
PMM0680.vid.2=0x2341
PMM0680.pid.2=0x824d
PMM0680.vid.3=0x2341
PMM0680.pid.3=0x024d
PMM0680.upload_port.0.vid=0x2341
PMM0680.upload_port.0.pid=0x804d
PMM0680.upload_port.1.vid=0x2341
PMM0680.upload_port.1.pid=0x004d
PMM0680.upload_port.2.vid=0x2341
PMM0680.upload_port.2.pid=0x824d
PMM0680.upload_port.3.vid=0x2341
PMM0680.upload_port.3.pid=0x024d
PMM0680.upload_port.4.board=arduino_zero_native
PMM0680.build.usb_product="PMM0680"
PMM0680.upload.tool=bossac
PMM0680.upload.tool.default=bossac
PMM0680.upload.tool.network=arduino_ota
PMM0680.upload.protocol=sam-ba
PMM0680.upload.maximum_size=262144
PMM0680.upload.maximum_data_size=32768
PMM0680.upload.use_1200bps_touch=true
PMM0680.upload.wait_for_upload_port=true
PMM0680.upload.native_usb=true
PMM0680.build.mcu=cortex-m0plus
PMM0680.build.f_cpu=48000000L
PMM0680.build.usb_product="pmm0680"
PMM0680.build.usb_manufacturer="PMM LLC"
PMM0680.build.board=pmm0680
PMM0680.build.core=arduino
PMM0680.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0680.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0680.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0680.build.variant=pmm0680
PMM0680.build.variant_system_lib=
PMM0680.build.vid=0x2341
PMM0680.build.pid=0x804d
PMM0680.bootloader.tool=openocd
PMM0680.bootloader.tool.default=openocd
PMM0680.bootloader.file=zero/samd21_sam_ba.bin


# PMM0681 (ESI Load Cell Weighing bridge Controller)
# --------------------------------------
PMM0681.name=PMM0681 (ESI Load Cell Weighing bridge Controller)
PMM0681.vid.0=0x2341
PMM0681.pid.0=0x804d
PMM0681.vid.1=0x2341
PMM0681.pid.1=0x004d
PMM0681.vid.2=0x2341
PMM0681.pid.2=0x824d
PMM0681.vid.3=0x2341
PMM0681.pid.3=0x024d
PMM0681.upload_port.0.vid=0x2341
PMM0681.upload_port.0.pid=0x804d
PMM0681.upload_port.1.vid=0x2341
PMM0681.upload_port.1.pid=0x004d
PMM0681.upload_port.2.vid=0x2341
PMM0681.upload_port.2.pid=0x824d
PMM0681.upload_port.3.vid=0x2341
PMM0681.upload_port.3.pid=0x024d
PMM0681.upload_port.4.board=arduino_zero_native
PMM0681.build.usb_product="PMM0681"
PMM0681.upload.tool=bossac
PMM0681.upload.tool.default=bossac
PMM0681.upload.tool.network=arduino_ota
PMM0681.upload.protocol=sam-ba
PMM0681.upload.maximum_size=262144
PMM0681.upload.maximum_data_size=32768
PMM0681.upload.use_1200bps_touch=true
PMM0681.upload.wait_for_upload_port=true
PMM0681.upload.native_usb=true
PMM0681.build.mcu=cortex-m0plus
PMM0681.build.f_cpu=48000000L
PMM0681.build.usb_product="pmm0681"
PMM0681.build.usb_manufacturer="PMM LLC"
PMM0681.build.board=pmm0681
PMM0681.build.core=arduino
PMM0681.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0681.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0681.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0681.build.variant=pmm0681
PMM0681.build.variant_system_lib=
PMM0681.build.vid=0x2341
PMM0681.build.pid=0x804d
PMM0681.bootloader.tool=openocd
PMM0681.bootloader.tool.default=openocd
PMM0681.bootloader.file=zero/samd21_sam_ba.bin

# PMM0682 ( ESI Hopper Scale Controller)
# --------------------------------------
PMM0682.name=PMM0682 ( ESI Hopper Scale Controller)
PMM0682.vid.0=0x2341
PMM0682.pid.0=0x804d
PMM0682.vid.1=0x2341
PMM0682.pid.1=0x004d
PMM0682.vid.2=0x2341
PMM0682.pid.2=0x824d
PMM0682.vid.3=0x2341
PMM0682.pid.3=0x024d
PMM0682.upload_port.0.vid=0x2341
PMM0682.upload_port.0.pid=0x804d
PMM0682.upload_port.1.vid=0x2341
PMM0682.upload_port.1.pid=0x004d
PMM0682.upload_port.2.vid=0x2341
PMM0682.upload_port.2.pid=0x824d
PMM0682.upload_port.3.vid=0x2341
PMM0682.upload_port.3.pid=0x024d
PMM0682.upload_port.4.board=arduino_zero_native
PMM0682.build.usb_product="PMM0682"
PMM0682.upload.tool=bossac
PMM0682.upload.tool.default=bossac
PMM0682.upload.tool.network=arduino_ota
PMM0682.upload.protocol=sam-ba
PMM0682.upload.maximum_size=262144
PMM0682.upload.maximum_data_size=32768
PMM0682.upload.use_1200bps_touch=true
PMM0682.upload.wait_for_upload_port=true
PMM0682.upload.native_usb=true
PMM0682.build.mcu=cortex-m0plus
PMM0682.build.f_cpu=48000000L
PMM0682.build.usb_product="pmm0682"
PMM0682.build.usb_manufacturer="PMM LLC"
PMM0682.build.board=pmm0682
PMM0682.build.core=arduino
PMM0682.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0682.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0682.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0682.build.variant=pmm0682
PMM0682.build.variant_system_lib=
PMM0682.build.vid=0x2341
PMM0682.build.pid=0x804d
PMM0682.bootloader.tool=openocd
PMM0682.bootloader.tool.default=openocd
PMM0682.bootloader.file=zero/samd21_sam_ba.bin

# PMM0683 ( ESI Convayor Belt scale Controller)
# --------------------------------------
PMM0683.name=PMM0683 ( ESI Convayor Belt scale Controller)
PMM0683.vid.0=0x2341
PMM0683.pid.0=0x804d
PMM0683.vid.1=0x2341
PMM0683.pid.1=0x004d
PMM0683.vid.2=0x2341
PMM0683.pid.2=0x824d
PMM0683.vid.3=0x2341
PMM0683.pid.3=0x024d
PMM0683.upload_port.0.vid=0x2341
PMM0683.upload_port.0.pid=0x804d
PMM0683.upload_port.1.vid=0x2341
PMM0683.upload_port.1.pid=0x004d
PMM0683.upload_port.2.vid=0x2341
PMM0683.upload_port.2.pid=0x824d
PMM0683.upload_port.3.vid=0x2341
PMM0683.upload_port.3.pid=0x024d
PMM0683.upload_port.4.board=arduino_zero_native
PMM0683.build.usb_product="PMM0683"
PMM0683.upload.tool=bossac
PMM0683.upload.tool.default=bossac
PMM0683.upload.tool.network=arduino_ota
PMM0683.upload.protocol=sam-ba
PMM0683.upload.maximum_size=262144
PMM0683.upload.maximum_data_size=32768
PMM0683.upload.use_1200bps_touch=true
PMM0683.upload.wait_for_upload_port=true
PMM0683.upload.native_usb=true
PMM0683.build.mcu=cortex-m0plus
PMM0683.build.f_cpu=48000000L
PMM0683.build.usb_product="pmm0683"
PMM0683.build.usb_manufacturer="PMM LLC"
PMM0683.build.board=pmm0683
PMM0683.build.core=arduino
PMM0683.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
PMM0683.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
PMM0683.build.openocdscript=openocd_scripts/arduino_zero.cfg
PMM0683.build.variant=pmm0683
PMM0683.build.variant_system_lib=
PMM0683.build.vid=0x2341
PMM0683.build.pid=0x804d
PMM0683.bootloader.tool=openocd
PMM0683.bootloader.tool.default=openocd
PMM0683.bootloader.file=zero/samd21_sam_ba.bin